Revit 2027 API
MEPSystem.SectionsCount Property
 The number of sections.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SectionsCount { get; }
Public ReadOnly Property SectionsCount As Integer
	Get
public:
property int SectionsCount {
	int get ();
}
member SectionsCount : int with get
Property Value
Int32
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace